; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v5 - type_2 ?v1 - type_1)
 	      (pred_1 ?v2 - object ?v1 - type_1)
	      (pred_2 ?v5 - type_2 ?v3 - type_3)
	      (pred_3 ?v5 - type_2 ?v2 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v5 - type_2 ?v7 ?v4 - type_1)
       :precondition (and  (pred_4 ?v5 ?v7))
       :effect (and  (pred_4 ?v5 ?v4)
		     (not (pred_4 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_2 ?v8 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v6) (pred_4 ?v5 ?v6) (pred_2 ?v5 ?v3))
       :effect (and (pred_3 ?v5 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v6)) 
		    (not (pred_2 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_2 ?v8 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v8 ?v3) (pred_4 ?v5 ?v6))
       :effect (and (pred_1 ?v8 ?v6)
		    (pred_2 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v8 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_11 - type_2
obj_06 obj_04 obj_09 obj_01 - type_3
obj_10 obj_08 obj_03 obj_13 - type_1
obj_14 obj_05 obj_02 obj_12 - object)
(:init
(pred_4 obj_07 obj_08)
(pred_2 obj_07 obj_06)
(pred_2 obj_07 obj_04)
(pred_4 obj_11 obj_08)
(pred_2 obj_11 obj_09)
(pred_2 obj_11 obj_01)
(pred_1 obj_14 obj_10)
(pred_1 obj_05 obj_13)
(pred_1 obj_02 obj_03)
(pred_1 obj_12 obj_08)
)
(:goal
(and
(pred_1 obj_14 obj_03)
(pred_1 obj_05 obj_08)
(pred_1 obj_02 obj_08)
(pred_1 obj_12 obj_03)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_03)))
)
)

; plan
1. (op_1 obj_07 obj_12 obj_08 obj_04)
   deleted: (pred_1 obj_12 obj_08) (pred_2 obj_07 obj_04)
   added: (pred_3 obj_07 obj_12 obj_04)
   goals met: 0 of 4
2. (op_3 obj_11 obj_08 obj_10)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_10)
   goals met: 0 of 4
3. (op_1 obj_11 obj_14 obj_10 obj_01)
   deleted: (pred_1 obj_14 obj_10) (pred_2 obj_11 obj_01)
   added: (pred_3 obj_11 obj_14 obj_01)
   goals met: 0 of 4
4. (op_3 obj_11 obj_10 obj_03)
   deleted: (pred_4 obj_11 obj_10)
   added: (pred_4 obj_11 obj_03)
   goals met: 0 of 4
5. (op_2 obj_11 obj_14 obj_03 obj_01)
   deleted: (pred_3 obj_11 obj_14 obj_01)
   added: (pred_1 obj_14 obj_03) (pred_2 obj_11 obj_01)
   goals met: 1 of 4
6. (op_3 obj_11 obj_03 obj_13)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_13)
   goals met: 1 of 4
7. (op_1 obj_11 obj_05 obj_13 obj_01)
   deleted: (pred_1 obj_05 obj_13) (pred_2 obj_11 obj_01)
   added: (pred_3 obj_11 obj_05 obj_01)
   goals met: 1 of 4
8. (op_3 obj_11 obj_13 obj_08)
   deleted: (pred_4 obj_11 obj_13)
   added: (pred_4 obj_11 obj_08)
   goals met: 1 of 4
9. (op_2 obj_11 obj_05 obj_08 obj_01)
   deleted: (pred_3 obj_11 obj_05 obj_01)
   added: (pred_1 obj_05 obj_08) (pred_2 obj_11 obj_01)
   goals met: 2 of 4
10. (op_3 obj_11 obj_08 obj_03)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_03)
   goals met: 2 of 4
11. (op_1 obj_11 obj_02 obj_03 obj_01)
   deleted: (pred_1 obj_02 obj_03) (pred_2 obj_11 obj_01)
   added: (pred_3 obj_11 obj_02 obj_01)
   goals met: 2 of 4
12. (op_3 obj_11 obj_03 obj_08)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_08)
   goals met: 2 of 4
13. (op_2 obj_11 obj_02 obj_08 obj_01)
   deleted: (pred_3 obj_11 obj_02 obj_01)
   added: (pred_1 obj_02 obj_08) (pred_2 obj_11 obj_01)
   goals met: 3 of 4
14. (op_2 obj_07 obj_12 obj_08 obj_04)
   deleted: (pred_3 obj_07 obj_12 obj_04)
   added: (pred_1 obj_12 obj_08) (pred_2 obj_07 obj_04)
   goals met: 3 of 4
15. (op_1 obj_11 obj_12 obj_08 obj_01)
   deleted: (pred_1 obj_12 obj_08) (pred_2 obj_11 obj_01)
   added: (pred_3 obj_11 obj_12 obj_01)
   goals met: 3 of 4
16. (op_3 obj_11 obj_08 obj_03)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_03)
   goals met: 3 of 4
17. (op_2 obj_11 obj_12 obj_03 obj_01)
   deleted: (pred_3 obj_11 obj_12 obj_01)
   added: (pred_1 obj_12 obj_03) (pred_2 obj_11 obj_01)
   goals met: 4 of 4
